[{"reviewer":"Doug H.","review_date":"8/16/2022","score":5,"comment":"First visit to Patterson's - we will be back.  I had the Big Breakfast burrito and half order of Biscuits & Sausage gravy.  The biscuits were amazing- fluffy center baked to perfection.  I could've smothered the Sausage gravy over anything.  It was very good.  Daughter #1 got the HUGE Peanut butter & chocolate chip stuffed pancakes.  A+.  The bride had the Power Quesadilla.  Also an A+."},{"reviewer":"Chelsea B.","review_date":"5/7/2022","score":4,"comment":"The Monte Carlo was amazing & the service was great!!! We are excited to try it again on our next trip to the area!"},{"reviewer":"Landon C.","review_date":"7/22/2021","score":4,"comment":"A good place for brunch. We came here during the summer so we didn't have to worry about a wait. We ordered a breakfast quesadilla, half order of biscuits and gravy, a kids pancake and the bacon, egg and toast. All were very good with quick service. The kids had the hot chocolate and it was great. If you are looking for a good breakfast while visiting Miami University or Oxford, give this place a shot."},{"reviewer":"Melanie U.","review_date":"7/21/2021","score":4,"comment":"Nice spot in Oxford that is a staple. Food and service has always been good, and during the school year this place can get busy. My co workers and I come here a lot, and I've taken my trainees here for a congratulatory meal. Breakfast items are usually my go to, and my friends like their burgers, bisque/soups and salads too. I've really enjoyed their breakfast bowl, and potato cakes. They also have fresh squeezed for a nice beverage."},{"reviewer":"Susan M.","review_date":"3/4/2022","score":1,"comment":"Ordered the breakfast bowl and I just have to say it was awful. The hash browns were cold and under cooked. The eggs were pulverized I couldn't tell if they were scrabbled or ran thru a blender. The gravy doesn't even classify as grave, tasted more like corn starch than anything. The biscuit was cooked in a muffin tin and so dense it was more like a hard dumpling. The bacon tasted like bacon bits out of a bag and overall salt content was enough to raise anyones blood pressure. But the coffee was good. When our server asked if everything tasted ok, I replied no and he literally ran away."},{"reviewer":"Ken N.","review_date":"9/24/2020","score":4,"comment":"Thanks to Yelp for pointing our group to this nice cafe near the Univ Miami campus.  Although it specializes in breakfast/brunch, we found plenty to choose from.  We pulled up to the convenient parking of this corner located shop.  The east side of the restaurant has outdoor seating with umbrella tables.  Inside, there was plenty of seating along the front windows as well as along the east wall near the bar area.  It was nice, so we let them know how many were in our party at the check in desk and we were given a table outside which suited us fine!I ordered a mixed fruit smoothie with a yogurt base (they had other flavors and you could substitute banana for the yogurt which my friend did.)  Both got excellent reviews for flavor!We ate around noon, so some of our group decided to go with brunch items like \"the Works\" omelet or the Benny Burger which is basically eggs benedict, with bacon, and a burger cooked to order.  That got rave reviews.  The portions here are really generous.  My wife ordered a BBQ burger (she got a to go box) and I ordered the crab cake sandwich which was quite different from what I've had elsewhere.  The bun was soft and tasty.  It was served with leaf lettuce and a tomato slice and had tartar sauce on the side.  I can't remember ever having crab cakes on a sandwich before, so tomato and lettuce were a new experience for me while eating this meal.  It was good, maybe not my favorite combo, but I'll give them credit for trying something different.Prices weren't cheap, but the food we ordered wasn't something you can just mindlessly crank out, so I think the prices were fair for the quality we received.Everyone agreed that it was a really good choice for a place to dine.  Service was good and paid attention without being intrusive.Review #3795"},{"reviewer":"Livvy B.","review_date":"7/3/2022","score":5,"comment":"A tad overpriced but the best brunch place on campus for sure. Lots of options (including gf) andddd the best screwdriver I've ever had"},{"reviewer":"Carey T.","review_date":"6/29/2022","score":5,"comment":"Amazing food. Best in Oxford for breakfast! Awesome coffee drinks and best Chai this side of the Mississippi!"},{"reviewer":"Noah T.","review_date":"4/27/2022","score":4,"comment":"Patterson's has great food and great service. I've never had a bad meal despite getting what feels like a majority of the menu over the years, and the orange juice is definitely what puts them into the next tier of breakfast places. They have everything from sleep-inducing comfort food to light, healthy options. This place can get busy and is not huge but they'll also do their best to accommodate you (once we accidentally told them 4 and a fifth showed up, and they just added a chair to our four top no problem). Plan on getting there before 10:30 and you won't have much of an issue. I think the food is a bit pricey for what you get but obviously, I'm still paying for it so can't say too much. Offering a to-go cup for coffee is one of my favorite things about it!"},{"reviewer":"Dana M.","review_date":"11/30/2021","score":5,"comment":"Fabulous gluten free Monte Cristi. Huge pancakes aabd large portions of spaghetti like home fries."},{"reviewer":"Ben W.","review_date":"5/4/2022","score":5,"comment":"Fantastic very yummy and always great service . I  always come early tho as the line fills up quick"},{"reviewer":"Amanda G.","review_date":"7/23/2019","score":5,"comment":"What a great find! Stopped in for brunch with my daughter. They were fairly busy but we got seated right away. She ordered an omelette and ate the entire thing so it must have been amazing! (Being 10 and all) I ordered the breakfast quesadilla and it was really good. I couldn't finish it all. Guacamole was extra but it was really good and a good touch!Great atmosphere, friendly people and good food!"},{"reviewer":"Missy H.","review_date":"10/24/2021","score":5,"comment":"Had the power egg quesadilla and it was yummy!! Busy when we got here but seated quickly. Would definitely come back when in the area!"},{"reviewer":"Evie R.","review_date":"4/18/2021","score":5,"comment":"Cool place! Has the historical feel with nicely done renovations like the mural wall. The food was greattt I ordered the regular breakfast, scrambled eggs toast and bacon and a side of the chocolate chip pancake. Very yummy it might help me pick Miami for college:))))"},{"reviewer":"Shane W.","review_date":"3/14/2021","score":4,"comment":"We took our college son and roommates to breakfast (table of 10) and after an hour wait (no reservations/call-aheads) we were seated and while busy, our waitress Sara was totally on top of everything. Our food came out shockingly quick for how bustling the place was, and everything was cooked perfectly. Great experience-- COVID protocols in place and staff were all masked."},{"reviewer":"Casey C.","review_date":"3/28/2021","score":5,"comment":"My girlfriend got the eggs, bacon, & bagel and she said they are good. I got the benny omelet & it was amazing! Would definitely recommend"},{"reviewer":"Merr M.","review_date":"10/24/2021","score":4,"comment":"Amazing breakfast joint...if you don't mind waiting ten years for a table and missing your nephews Bar mitzvah... amazing food and service!!! Ice coffee was a little lukewarm I will not lie. Definitely recommend this place if you're looking for a good hangover spot!"},{"reviewer":"Marion R.","review_date":"1/25/2020","score":2,"comment":"Ok the place is fabulous! But my score is low because I wanted the food to be better. The coffee was not BOLD like they said. The fried potatoes need more country style in them. They ought to ask if you want bacon half fried. Everything else was fabulous."},{"reviewer":"Kymberlei T.","review_date":"6/2/2021","score":3,"comment":"they do not do takeout!!!   only in house or very local delivery!    what a shame.  their food is decent."},{"reviewer":"Emily C.","review_date":"11/23/2019","score":2,"comment":"The food is fine I guess. I do not really understand the hype around this restaurant other than there aren't many places to grab brunch in Oxford. Every time I have gone here the food has been subpar and I could have made something better at home. I thought maybe I just wasn't ordering the best food, but I gave up on going there because it is just so disappointing and a waste of money."},{"reviewer":"Phil H.","review_date":"6/17/2021","score":5,"comment":"Always break breakfast spot. I took my girlfriend and her best friend around 11. There was no wait, but it got really busy after we sat down. You can't go wrong with the breakfast bowl."},{"reviewer":"Emily G.","review_date":"9/3/2018","score":5,"comment":"I have been dreaming about cookies and cream pancakes ever since I graduated 6 years ago. So when I came back to campus and hit up Patterson's, I was pleasantly surprised to see that not a thing had changed, food was just as delicious, service was just as good, and the place is just as homey. Patterson's is certainly an oxford establishment that will always have me coming back for more every-time we pass through town. This is the brunch place for sure to check out while in Ox-Box!"},{"reviewer":"Sarah W.","review_date":"1/9/2021","score":5,"comment":"My favorite college brunch spot! Even since graduating, no trip to Oxford is complete without going to Patterson's. I always look forward to their flavored coffee option of the day. Their fresh squeezed orange juice, sourdough French toast, cinnamon pancakes, veggie breakfast quesadilla, and breakfast potatoes are go-to favorites."},{"reviewer":"Christine C.","review_date":"11/26/2019","score":5,"comment":"Amazing brunch place! Their orange juice is worth every penny. One of the best pancakes and eggs Benedict I've ever had!"},{"reviewer":"Jr W.","review_date":"9/22/2020","score":5,"comment":"Super nice place to eat very clean very friendly very good food I will be a repeat customer and promise"},{"reviewer":"Tammy N.","review_date":"1/29/2019","score":4,"comment":"This restaurant knows how to serve it up. Friendly and very hospitable service. What amuses and impressed me the most is their creative style with their menu. I wish I had taken a picture of it. The menu was not only full of greatness but it was presented extremely well. I usually don't talk much about menus. It's normally the food itself. Not only was the food great, reasonable in price, it had a creative kick to it. What place has a mimosa and a manmosa, which is a guy's version of a mimosa with beer!! It's a little far to drive from Cincinnati to Oxford for breakfast but if you're heading that way, it's worth the stop."},{"reviewer":"Henry J.","review_date":"1/5/2019","score":4,"comment":"The short version: this is basically a IHOP or Denny's on steroids.I'm a fan of all day breakfast. Omelets to me are good for breakfast, lunch, and dinner. To that nd, Patterson's delivers. Their pancakes are very good too, though one of their fanciers ones are a little too ornate for their own good. Sometimes, pancakes are best served fluffy and plain so that the diner can throw a multitude of syrup in any combination to taste.Other than that, their items have huge (yuge?) servings. Some of my colleagues always have to get a to go box to take some home. And speaking of home, their home fire are excellent too. Very well-seasoned scalloped potatoes are perfect companions to any breakfast and lunch item. Their bottomless coffee help to wash everything down as well. Back in my college days, this would be the perfec place to go after a super fun night."},{"reviewer":"Elizabeth C.","review_date":"6/20/2020","score":2,"comment":"We did take out and they forgot our drinks. We paid $9 for two orders of potatoes and only got one serving. Disappointed :("},{"reviewer":"Debbie E.","review_date":"11/29/2018","score":4,"comment":"Oh yah!  Breakfast all day at Patterson's.  Eggs Benedict were good, biscuits and gravy ok.  Fried potatoes were orange, not sure why but tasted ok.  Plenty of parking and friendly staff.3.5 stars"},{"reviewer":"Samantha C.","review_date":"9/8/2016","score":4,"comment":"This place is so delicious and efficient. I say efficient because while it's a very small place, they do a great job of getting you seated relatively quickly and serving food quickly as well.The food is amazing, priced reasonably, and clearly fresh.They have an array of options and the portions are beyond generous so it's def worth the money for a hearty breakfast or brunch."},{"reviewer":"Brian M.","review_date":"10/20/2019","score":5,"comment":"Outstanding food. Very nice staff. Wish I could have tried mire than just breakfast. Close to campus but having a car to drive there was nice. Lots of shops nearby like CVS and UPS Store."},{"reviewer":"Joseph G.","review_date":"3/7/2020","score":5,"comment":"Still my favorite breakfast place in Butler County so far. Breakfast can be busy, especially during the school year. Get there early."},{"reviewer":"Ty B.","review_date":"11/14/2017","score":5,"comment":"Patterson's is an Oxford staple. You'll have a hard time finding a better breakfast. Fresh squeezed OJ, killer omelettes, and awesome (and very unique) home fries. The lunch selections are tremendous too! Try the Mike's Favorite Omelette with white American cheese--they put the homefries inside the omelette! Friendly and speedy service, and very affordable prices. Everything is fresh, local, and home cooked. Make sure you enjoy this when you're near Miami!"},{"reviewer":"Matt L.","review_date":"3/17/2018","score":5,"comment":"Great food and service. Fairly small seating area but clean and modern.  Gluten free pancakes nice surprise on the menu, also St Patrick's day green pancakes and eggs"},{"reviewer":"Joe M.","review_date":"12/29/2016","score":4,"comment":"Perfect place to meet up for breakfast in Oxford. Lots of locals. My eggs were great. My son had pancakes and he loved them. Service was good. For sure will come back my next time in town."},{"reviewer":"Darius L.","review_date":"1/11/2015","score":2,"comment":"We were visiting town and I was excited to find a local place next to campus for breakfast. I was a bit let down by the whole experience. The coffee was really good and the menu looked promising. I was hungry so I ordered a kitchen sink omelette and my wife and kids ordered another omelette and some pancakes. I finished my coffee and started looking for our waitress to offer a refill. The. We waited and tables around us who ordered after started receiving their meals. 25 minutes later I finally saw our server and asked about our order. I told her that we were trying to get somewhere. She looked worried and she told us that the table next to us had their orders in after ours so we should be coming up soon. We ended up asking for everything to go, because after 45 minutes of waiting we had to get going. So we get into the car - pancakes were big but looked like they were bisquick based. The strawberry pancakes had some diced strawberries cooked into it. I wasted $10 on my omelette. It was a pile of sautéed meats and veggies with a round disk of eggs laid on top of it. Maybe I ordered the wrong thing... Like ordering an omelette at a place that specialized in waffles. Or sandwiches... All I know, is try something else if you come here."},{"reviewer":"Danyail H.","review_date":"5/24/2018","score":5,"comment":"Unfortunately i went on a Sunday and the bar didn't open until 11. Ill definitely be back though. The OJ  was freshly squeezed at their bar, it was super tasty. Heavy on pulp! I ordered toast with an egg and a side of avocado. All of it was incredible ! W"},{"reviewer":"Phillip T.","review_date":"8/25/2019","score":5,"comment":"Excellent breakfast today with two getting the breakfast Quesadillas, one getting a veggie omelette and one getting a power wrap. All were done just right and very tasty for all. The service is great and the servers are friendly and attentive. Also, it is located away from the busy uptown area with ample parking."},{"reviewer":"Savannah H.","review_date":"2/15/2019","score":4,"comment":"This is a popular breakfast/brunch spot, especially on the weekends. Most of the time, it's worth the wait. The menu is extensive and really delivers. The fresh-squeezed orange juice is great in a mimosa or on its own. The Highlander Grogg coffee is a must-have. During breakfast hours, some of my favorite menu items are the eggs benedict with crab cakes, the Monte Cristo, and the strawberry cream cheese stuffed French toast. During lunch hours, I recommend the lobster bisque. Though there is a lot of seating, there's very little room to wait until a table is ready. The line is usually out the door on the weekends. I would give Patterson's five stars if the service were more consistent."},{"reviewer":"Richard D.","review_date":"3/17/2017","score":5,"comment":"Great Irish breakfast: Grilled Bangers with country fries and fried eggs and sourdough toast! Delicious!"},{"reviewer":"Martin E.","review_date":"2/10/2019","score":5,"comment":"This is one of my top three restaurants in town. The food is outstanding. The service is great and the host/hostess/owners are awesome! We've never had a bad experience here. I highly recommend this for breakfast and lunch, but get here early. It's very popular with the college crowd."},{"reviewer":"Mindy Y.","review_date":"4/24/2015","score":4,"comment":"If you love breakfast (even for lunch), then this is the place for you. They have a good breakfast menu and the portions are good. I ordered the homemade strawberry cream cheese French toast and it was good. I was actually expecting a little more with the French toast, like maybe stuffed with cream cheese or something. I didn't expect them to just pour the sauce on top...."},{"reviewer":"Barbara W.","review_date":"7/10/2016","score":4,"comment":"Amazing prices. Good fresh food. Friendly staff.We were visiting from out of town and went \"late\" (1:00 pm on a Sunday). Service was timely.The wrap one of our party ordered was the size of an overstuffed Chipotle burrito. I had turkey and avocado omelet which was very flavorful and fluffy. The turkey had a light smoky taste.Menus are huge and we had a hard time choosing our entree. Would definitely go back."},{"reviewer":"Shamika K.","review_date":"5/22/2016","score":4,"comment":"Who doesn't love a local cafe?! Patterson's hits the mark every time! They are the best place to get breakfast or brunch in Oxford! In the morning during the week (Monday-Friday) they have a \"breakfast club\" which is a special menu with great deals and great prices! My favorite is the toast and eggs. Yum! Their pancakes are light and fluffy and fill an entire plate. One is plenty if you're getting other side items. I enjoy their Highlander Grogg coffee and they'll even give you a cup to go if you want! The weekends it's so crowded so I suggest going early on the weekends or checking them out during the week. A great Oxford gem that everyone should check out!"},{"reviewer":"Ethan B.","review_date":"8/5/2015","score":4,"comment":"This is good spot to bring your parents, or recover from a hangover with some quality breakfast food. The coffee tastes great, and they have a huge selection of breakfast favorites for anyone. The French toast, eggs Benedict, and monte cristo are very good."},{"reviewer":"Peyton M.","review_date":"11/8/2015","score":5,"comment":"What a find in Oxford!  About a 30 minute wait on Saturday morning but the fresh orange juice and delicious breakfast was worth the wait."},{"reviewer":"Kyle K.","review_date":"3/3/2018","score":5,"comment":"We rolled up to Pattersons in search of a cure for a hangover. I had an iced coffee and a breakfast quesadilla. Food was delicious and very reasonable. Our server Sam P was helpful and attentive. I didn't have to ask for a refill. All in all a 10 out of 10 brunch experience in Oxford Ohio."},{"reviewer":"Kevin W.","review_date":"3/31/2018","score":4,"comment":"I can't think of anything wrong with Patterson's other than the long waits... Their food is impeccable. The menu is such diverse. much good food and drinks. One dollar Bud Lights; Can ya dig it?! But seriously, the service is wonderful. My fiance and I had a waiter named Jeremy who was wonderful. I ordered a breakfast burrito and it exceeded my expectations. Perhaps too much. Now I have no idea what I am doing in college here. I dropped out of 3 of my classes. I am only signed up for 6 hours. Oh well. I guess it is true what they say; the cookie doesn't fall far from the tree. Great food and service: 4/5. Would eat 'ere again."},{"reviewer":"Steven S.","review_date":"12/1/2014","score":5,"comment":"Great food and great coffee.  Huge pancakes.  Delicious food (wife ordered Hangover Special).  Very friendly and attentive service.  Lunch menu looked good as well - will definitely make this a regular stop when in Oxford."},{"reviewer":"George N.","review_date":"10/14/2017","score":4,"comment":"Cool atmosphere, great menu, solid service, decent food. Went for Fathers Day brunch with large group, they took great care of us. Most ordered breakfast, I had eggs over medium, toast and bangers. Was yummy, especially bangers. Most didn't eat their fried potatoes, complained they were tasteless. I sampled and agreed (maybe spice them up a bit!). Would definitely go back!"},{"reviewer":"Terri P.","review_date":"10/14/2017","score":5,"comment":"Humongous menu... everything delicious and hot!  Great tasting coffee.  Drive 30 min just to try it and it was well worth it."},{"reviewer":"Sara W.","review_date":"12/7/2014","score":4,"comment":"I'm a Miami alum and went to Patterson's while visiting campus this past weekend. At 10:30 on a Saturday we had a 10-15 minute wait which wasn't too bad. I ordered a cheese and egg bagel sandwich which was fantastic. My dad ordered the Ben's breakfast ($9) which was a ton of food so he shared. The bacon was cooked well, the sausage (real sausage!) was tasty, and the pancake was delightfully fluffy. My brother's waffle with homemade whipped cream was also delicious. I would definitely recommend Patterson's for breakfast, parking is free and readily available which makes for a nice change from the rest of Oxford. You could tell it was a mix of current students curing their hangovers and parents visiting from out of town looking for a great breakfast spot."},{"reviewer":"Dale O.","review_date":"11/11/2017","score":5,"comment":"I had a great brunch there last weekend with my son. The wait was long, but well worth it. Great food product and magical service. I had the lobster eggs Benedict and it was terrific. Even better were the home fries that came with them. I'd definitely go back I'd give the opportunity."},{"reviewer":"Sean L.","review_date":"8/2/2015","score":4,"comment":"If you find yourself in Oxford looking for a good breakfast... The look no further than this little local gem!  The fresh squeezed OJ was a great start on my big breakfast. They have a vey extensive breakfast menu covering the basics (bacon, eggs, toast) to some traditional Irish favorites (boxy) and homemade granola. Service was very friendly and food was fast, hot, and fresh. Will definitely be back!!"},{"reviewer":"James W. R. C.","review_date":"6/1/2016","score":5,"comment":"Such a great brunch spot in the heart of Oxford, OH. Located within Miami Universities campus, this offers students a great place to catch a nice and hot breakfast. I ordered a egg white omelet with sausage, peppers and avocado. It was amazing! It came with an english muffin and some homemade grape jelly which was such a complimenting side. The sausage had huge flavor and the avocado was fresh as they could be! Every time I come to visit the Miami University this is my first stop for breakfast."},{"reviewer":"Ramey K.","review_date":"11/21/2015","score":4,"comment":"Patterson's is a great brunch spot when the line isn't 2 hours long. I always get the eggs over easy on top of their delicious blueberry muffins. They also have really good fresh squeezed oj but the potatoes are super average. Good food, waiting sucks."},{"reviewer":"Emma H.","review_date":"4/7/2013","score":3,"comment":"Great breakfast for a great price. Cozy atmosphere and delicious food. The young staff could have been more attentive but overall a good experience.Coming back almost two years later and noting gas changed. Still good food, but below average service. Don't come here if you're in a hurry to get somewhere."},{"reviewer":"Ashley M.","review_date":"9/20/2017","score":5,"comment":"Just had a great breakfast there this morning!! Cinnamon chip pancakes are awesome!!    I got bens breakfast.   One thing I will do different next time is tell them to make my homefries crispy. Not like fried potatoes...   but very good food!!"},{"reviewer":"Tina B.","review_date":"1/17/2017","score":4,"comment":"Service was super fast and the place was very charming inside. Omelette was huge, BLT was fantastic, Egg wrap awesome and the boxty's were amazing! Great place to eat when visiting Oxford!"},{"reviewer":"Burgess C.","review_date":"2/15/2017","score":5,"comment":"The egg wrap was delicious and the service was excellent! Look forward to my next visit!"},{"reviewer":"Alle A.","review_date":"8/19/2015","score":2,"comment":"I recently dined at Patterson's which i'd had before and had good experiences. This time I got the lox and it was so bad it made me feel sick. I told my waiter about this and he offered me something else but still did not end up taking it off the bill. I was disappointed with my recent experience."},{"reviewer":"Mallory B.","review_date":"2/12/2014","score":5,"comment":"They have breakfast specials if you go between 7 and 9 am, like dollar coffee and $3 French toast. Can't beat it! The food is great and the servers are bright and friendly. I haven't tried it after 9 am but it's a nice place to hang out before work :)"},{"reviewer":"Scott S.","review_date":"11/18/2016","score":5,"comment":"Excellent restaurant, a little bit of everything for every budget coupled with a fabulous atmosphere. Breakfast is generous and you will have leftovers."},{"reviewer":"Chelsea W.","review_date":"2/10/2013","score":4,"comment":"Yum yum and yum. If the number of people waiting to get in the door tell you anything, it's that this place is one of the best breakfast/brunch spots in Oxford. Totally worth the wait!The eggs benedict dish is just delicious. They have lots of great substitutes, like crab cakes, tomatoes, sausage, or spinach. I stick with the classic English muffin and canadian bacon and it is always cooked perfectly and served with thin sliced and seasoned potatoes.The menu is huge...it's almost impossible to go here and not find something you love! The egg wraps are crispy, melty, deliciousness, but you have to ask for salsa and sour cream with these. The oatmeal is cheap and well-prepared. Patterson's has every omelette you can imagine. The coffee is good, especially the Grog blend.  I've never tried the sweet stuff, but I saw a wide variety of pancakes and french toast on the menu. They even had Cookies and Cream pancakes, made with oreos and topped with whipped cream. Sounded great!!Patterson's is slightly off the beaten path in Oxford, but once you find it, you'll remember it whenever you're hungry for breakfast! I can't wait to try their lunch menu next time I'm in Oxford."},{"reviewer":"Scott S.","review_date":"4/29/2014","score":4,"comment":"Very good breakfast! This is my favorite meal of the day and, as I did this time, I had it for a late lunch. Menu has a ton of choices, service is very good. We were there during a weekday afternoon on a short trip so it wasn't too busy.Definitely would go back!"},{"reviewer":"Whit R.","review_date":"10/12/2013","score":4,"comment":"Patterson's is consistently good - good food, good service, good location/parking.I recommend going for breakfast on a weekday, as they get packed early on the weekends.  Their breakfast menu is comprehensive and has something for everyone, from yogurt with fruit to omelets to breakfast sandwiches to pancakes (including some distinctive flavors and ingredients).  The coffee is good, too.Service at Patterson's is typically above average, which for me is crucial early in the morning.  Bad service in the AM gets old pretty quickly, and I unfortunately have little patience for it first thing.  It's mostly high school and college-age girls, with smiles on their faces and attentive but not overbearing manners.Prices are moderate - no really sweet deals but the menu doesn't trend quite as high as many other locations in Oxford, either.  It's a $8-10 breakfast.I don't get in for lunch as often as for breakfast, but my experiences at midday have always been positive, too.I'll be back."},{"reviewer":"Julie C.","review_date":"7/27/2018","score":5,"comment":"Two adults and five kids on a tight schedule. Friendly server, food within 10 minutes, all of us ordered something different and food was great. Also economical. Great place and would go again if back in town."},{"reviewer":"Brian B.","review_date":"7/13/2016","score":5,"comment":"Had breakfast here before picking my boy up from hockey camp. I had the Irish Bangers breakfast and a half order of biscuits and gravy. The food was great, as was the atmosphere. The service was fantastic!!! Will definitely eat here again when in the area."},{"reviewer":"John T.","review_date":"4/16/2018","score":3,"comment":"Based on a number of the reviews we were hoping for a great local's place for breakfast. Instead it was basically Ok. The special of the day was lobster eggs benedict, and it was well done. The side of hash browns lacked seasoning and the potatoes were undercooked. The boxty was recommended by the waitress, and maybe it was an off day but it was cold and the texture was rubbery. It was difficult to cut with either a fork or a knife, which is not what I expect from something like that. The fruit cup was so-so as far as the ripeness of the fruit. The service was responsive; they were not very busy at 8am on a Monday."},{"reviewer":"Lisa R.","review_date":"6/20/2015","score":2,"comment":"We came here at 2:00 on a Saturday and had a 25 min wait. The lunch menu looked extensive, but I think this place is known for its breakfast. Drinks were delivered timely, but apparently you have to ask for a straw?!?!  That took 10 min. I had the BELT burger. It was dry. My husband had the Chipotle burger and he thinks they forgot to put any and all spices on it. My daughter had the Mac and cheese stuffed grilled cheese and wasn't impressed. She said it was just ok. The chips were good."},{"reviewer":"Sean D.","review_date":"5/9/2011","score":4,"comment":"Pretty good -- of the sit-down breakfast options in Oxford, this is clearly the best.  Plusses: Generally friendly service, big portions (too big, really), and the fresh-squeezed orange juice.  Cons: They tend to way overdo it with the potatoes, quality is sometimes varied (got some burned bacon there recently), and the dishes I want to be amazing (e.g., their many eggs benedict variations) are never quite what I want.But, beggars can't be choosers.  After years of no breakfast options in Oxford, Patterson's became a passable one at their old location.  With the new location, they've expanded their menu and stepped up their game.  It's not a gourmet's delight, but it's solid and affordable.They have since expanded their menu for lunch/dinner, but I haven't tried it.  It's a place I go for breakfast, and that's likely all it'll ever be to me."},{"reviewer":"Cathie G.","review_date":"8/5/2011","score":3,"comment":"Based on the reviews on here I had high hopes for Patterson's. These were somewhat disappointed. For some reason I found their chairs uncomfortable (but my husband assures me they were fine). We were there for breakfast and we both agreed the coffee was pretty terrible. It just didn't taste good.  My husband ordered the huevos rancheros, and I had the eggs Benedict. In both cases the presentation was a little sad:  A huge amount of orangey home-fried potatoes, which in his case were topped with scrambled eggs and mole sauce and in my case were accompanied with the eggs Benedict--two English muffins with eggs and ham literally drowning in a sea of yellow hollandaise sauce. My husband had already known that his huevos were going to be served with a mole sauce, so that did not surprise him. He did say he would have preferred the eggs to have been over-easy and with more vegetables--tomatoes, peppers etc..he will not order the same thing again. My eggs Benedict, apart from the somewhat unsubtle presentation were actually quite good. The ham was tasty as was the sauce and even the orangey home-fries grew on me. Next time we'll try and get a booth and we'll probably order something else. Maybe we'll try one of the many \"eggs in a tortilla option\" that bear the unfortunate name of \"the fatty\" - which I suppose is intended to be humorous but I find just a little off-putting."},{"reviewer":"Joe P.","review_date":"11/9/2014","score":2,"comment":"Been here multiple times. Breakfast is overall pretty good, especially the fresh OJ. Wait times are ridiculous and wrongly estimated. We are always told it'll only be about 30 minutes, and then end up waiting an hour or more. Would love to see another breakfast place in oxford to give these guys some competition, because right now they pretty much have a monopoly in Oxford."},{"reviewer":"Brock L.","review_date":"9/6/2011","score":4,"comment":"Patterson's Cafe remains one of the best place for breakfast/brunch. Although it is pricier than other venues in Oxford, you can immediately tell by the atmosphere and quality of food that it is worth the money (with the exception of the OJ... no reason why 16+oz cup of OJ should cost $6, even if its fresh, but I digress). Patterson's breakfast items remain one of the best place in Oxford, and is a great place to go with friends and family.I will have to admit though that their change in dinner menu, although understandable, is not to my liking. One of the aspects I loved most about Patterson's was knowing that I could go anytime of the day and get some quality breakfast food items. Now I'm stuck with expensive dinner times, that are a tad mediocre at best. All in all though, its still a top place for breakfast/lunch goers"},{"reviewer":"Tyler H.","review_date":"8/2/2014","score":4,"comment":"This was a nice find in small town Ohio. Anywhere that has good pancakes is a place that I like. Also, the service was perfect. I like the restaurant design and comfort. I'll definitely return if I'm in the area."},{"reviewer":"Daniel T.","review_date":"6/12/2017","score":5,"comment":"Went there for brunch and scheduled another round for the next day. Servings are more than enough and taste is out of this world. Would recommend to anybody that likes good food for a great price"},{"reviewer":"Hannah P.","review_date":"9/7/2011","score":4,"comment":"Oh, Patterson's, how I love thee. Great breakfast foods -- the omelets are huge and the stuffed french toast is delicious. I've never been here for lunch or dinner but the menu looks great; just a little pricey. Live music on Wednesdays. Get here before 10 a.m. on the weekends or you'll face a 45 minute wait alongside loud Miami students (yes, I used to be one of them). This place used to be Uptown in a very small location. It was homey and cozy. It's bigger and better now, with a liquor license, but there's still a huge crowd problem. But that's a good thing because it means the food is good, and Oxford definitely lacks breakfast establishments."},{"reviewer":"Janet S.","review_date":"7/24/2012","score":4,"comment":"The portions are huge at Patterson's.  The service was fine as we went on a Wednesday morning and it wasn't very busy.  Our friends had pancakes which were enormous.  The lox and bagel caught my eye, but I really didn't want the bagel.  So I asked if I could have the lox on a muffin instead and they readily granted my wish."},{"reviewer":"V B.","review_date":"3/30/2017","score":1,"comment":"I don't like the food here.  Sorry.  The breakfast potatoes are bland and usually served cold.  The pub salad is served with large chunks of onions on top that look like they were sliced a week ago.  The lettuce hidden under the large piles of fixings looks wilted and clear.  They serve large slices of tomatoes on the side of the plate.  More is not always better.  Lots of bland here.  The avocados are slime.  Totally unappealing.  I've been here 3 different times over the last 2 years and don't see the appeal."},{"reviewer":"Mike W.","review_date":"8/10/2014","score":4,"comment":"The food is pretty tasty here. It's in the college town and next to a hotel so it gets busy really quick. There are a few seats to sit outside if you wish. The wait staff is nice and very tentative."},{"reviewer":"Wenzel D.","review_date":"10/14/2017","score":2,"comment":"Decent food, albeit overpriced combined with lackluster service and ownership that literally ignores customers opinions or complaints.  Always crowded due to it being the only breakfast place in town with table service."},{"reviewer":"Daniel G.","review_date":"3/30/2014","score":4,"comment":"Patterson's is everyone's favorite Sunday brunch spot, and for good reason.  They're food is great and service friendly, and their fresh squeezed orange juice can beat any hangover.  The only downsides are that the wait can be over an hour if you don't get there early."},{"reviewer":"Carl F.","review_date":"12/30/2016","score":5,"comment":"We were in town for a hockey showcase. We stopped in needing a table of 8. Even though the place was crowded we were seated pretty quickly. I had the Eggs Benedict and my son had the Ooey Gooey Omlete. This was the BEST breakfast we have EVER had! I just wish we didn't live so far away."},{"reviewer":"Heidi M.","review_date":"7/21/2018","score":3,"comment":"Have been here a couple times before and service was really good, GF options yummy too. This time was lousy for me though. Ordered GF pancakes and turkey sausage. Sausage tasty but the GF pancakes chewy/doughy in consistency, thought they weren't cooked enough so had waitress take them back for a redo and brought the same ones back (almost as if they'd been microwaved) completely inedible. Waitress never asked how they were and didn't offer to take them off bill. Really disappointing as this was a place we like to come to when coming to Oxford for swim meets cause the GF options and service usually good. Other family member food ok but mine was blah, had to pull out my ER GF bread and make a mini sausage sandwich as I was hungry. BUT! If you are GF make sure to check out the Kofenya Coffee House instead of this place. Delicious GF pumpkin choc chip donuts and banana bread. Wonderfully brewed coffee. kofenyacoffee.com"},{"reviewer":"Patrick H.","review_date":"6/28/2013","score":5,"comment":"Excellent breakfast.  Definitely intending to go back here on a regular basis."},{"reviewer":"Dennis P.","review_date":"10/6/2016","score":3,"comment":"Its the best breakfast restaurant with table service, but then its the only breakfast with table service.  Great coffee. The service is generally good and they do have a great bloody mary and mimosas.  Usually decent, but last time I went when in, about 10:30 am last week, it was not busy at all. I ordered the Bens Breakfast and the eggs, toast, potatoes and pancake were all lukewarm at best.  Either the plate warmer was broken or they dont use one, but it was very disappointing.   Sadly, in the week since, I have not heard a reply to the messages I left the management."},{"reviewer":"Kristen Z.","review_date":"3/6/2015","score":1,"comment":"I have never been treated so rudely at restaurant in my life!! And I'm not all that young. We went there to eat after a swim meet so it was quite busy. My niece ordered what she thought was a Philly cheese steak. But it was not. It was a slab of very fatty steak on a bun. So we asked our server to send it back and got a salad instead. Didn't seem like a big deal. Have sent food back in other places before. Well it did become a big deal when we got our bill and we had been charged for the steak we did not eat. So our server got his manager. Wow hope she is only the manager and not the owner. First we were told it was our fault. Then we were told we needed to order the correct steak sandwich instead of the salad which we ordered instead of the wrong one. Then she looks at my niece and tell her she needs to read the menu better the next time!!!!!! Really!!!!!! HOW ABSOLUTELY RUDE!!!!! Then she goes to the cash register gets what we paid for the sandwich and throws the money on the table and walks away!!! Wow!!! Because of this one horribly rude person we will never step foot in this place again!! Really, get in a kids face and tell her to read the menu better the next time!!!! I have never seen such rudeness ever!! FYI to owners - fire this lady if you want your customers to return!!!!!!!"},{"reviewer":"Christina A.","review_date":"3/24/2015","score":2,"comment":"This place could be so good. But it's not. We waited for ten minutes before we were even acknowledged. Service was decent. But this was the second time something has been severely undercooked. I never write bad reviews but this place deserves one after a second chance."},{"reviewer":"Kendall S.","review_date":"2/13/2016","score":5,"comment":"Patterson's is the best breakfast place in Oxford! They have a lot of variety on the menu so you can honestly go here everyday without getting bored. There is great hospitality, food, and the hot chocolate is to die for. On weekdays, you can sit down immediately and your food comes out within minutes. On weekends, there are usually over 15 people waiting to eat so you might have to wait if you don't get there early. They also do take out which also takes maybe 10 minutes. I love Patterson's!"},{"reviewer":"Roger B.","review_date":"9/25/2011","score":5,"comment":"Second and third visits during family weekend for breakfast.  This place is great with good food and excellent service.  You will most likely have to wait but it is worth it!"},{"reviewer":"Carlos M.","review_date":"1/24/2013","score":5,"comment":"Best breakfast in town.  Plus they have a bar.  Bloody Marys anyone!?"},{"reviewer":"Megan S.","review_date":"10/29/2013","score":4,"comment":"I used to live right next to Patterson's, and they were fantastic. We started going there so often (who wouldn't when they lived next door) so they would just call us when a table was ready for us. The food is great and the service is fantastic. My mom's favorite place to go for brunch when she visited"},{"reviewer":"Lizzy R.","review_date":"7/28/2015","score":5,"comment":"Today we went to lunch at Patterson's. We usually go for breakfast which is always delightful. Lunch was equally great!  I had the bacon turkey quesadilla with avocado. My mom had a burger and so did the kids, which they all enjoyed. My hubby had the eggs Benedict which is his fav at Patterson's. Once again it was a wonderful experience."},{"reviewer":"Chris S.","review_date":"7/14/2013","score":4,"comment":"Great atmosphere, good service and good food.  This place is in a lovely quaint part of Oxford and the decor is quite nice.  Though the name of the place seems Irish, the food is slightly not as Irish as I was hoping.  The menu is also MASSIVE, which is unfortunately not a good thing. The burgers were delicious and fresh and had me wanting more. Portions were generous, which is always great for a consumer. The mac and cheese tasted a day old and reheated. That is my only food complaint so far, but I plan on going back and trying more. Until then, this is a great place to grab a bite to eat and just enjoy life."},{"reviewer":"Stuart D.","review_date":"4/21/2013","score":4,"comment":"Great breakfast. Loved the fresh squeezed OJ. A bit of a wait, but well worth it!"},{"reviewer":"Rob L.","review_date":"8/23/2010","score":5,"comment":"How can you possibly go wrong with Patterson's!? Always terrific food that is priced so well. Great service, great people, great crowd. Everyone needs to experience Patterson's."},{"reviewer":"April H.","review_date":"8/12/2012","score":2,"comment":"We have been to Patterson's many times (as we are Oxford Community Members). We typically have a good experience. However, they recently introduced their new Gluten Free Menu with all sorts of Gluten Free Options! We were thrilled!!! However, there was something MAJORLY wrong with their Gluten Free Pancakes. I'm guessing they used too much vinegar or something (because they takested like sour-dough). We sent them back and were fine with that. That is no big deal...sometimes things are just off. What we didn't appreciate is how the manager handled it. No appology for un-edible pancakes(in fact insisting that there was nothing wrong with them), a snotty response to my husband who was being nice, having to ask them multiple times to take the bad pancakes off the bill, and just overall horrible customer service. I'm afraid Patteron's will not be on the list of breakfast places that we go anymore...which is a bummer because we ate there often."},{"reviewer":"Scott W.","review_date":"6/22/2010","score":5,"comment":"Patterson's has moved from its former High Street location to Stewart Square.  Same great food & atmosphere in a larger, beautifully designed location."},{"reviewer":"Dominique M.","review_date":"7/18/2014","score":5,"comment":"Service, food, drinks, owner.... Awesome!!!! Great place! Definitely recommend this venue and will come back!"},{"reviewer":"Rick B.","review_date":"4/2/2013","score":4,"comment":"Very nice breakfast. Good eggs Benedict."},{"reviewer":"Dana C.","review_date":"1/28/2011","score":5,"comment":"They've changed locations since I was an undergrad, but this is definitely the best place to go for brunch on the weekends.  You can't go wrong with anything on the menu.  Their former location was smaller, and we would wait for at least 45 minutes to an hour, but it was well worth it!"},{"reviewer":"Lolita H.","review_date":"10/27/2011","score":3,"comment":"Generally the food and service is very good, especially the breakfasts.  Not a lot of choices if you're wanting a salad or something light. However, the broccoli cheese soup is terrible.  No evidence of brocolli, tastes like maybe it is melted cheese, onions, milk and flour put in the blender."},{"reviewer":"John S.","review_date":"7/23/2012","score":2,"comment":"Food is decent, but service often is poor. A rotating cast of college students doesn't inspire confidence. Pancakes should come with butter and syrup... it might be a good idea to deliver both automatically, maybe even BEFORE the pancakes arrive. Blueberry pancakes generally have blueberries cooked INSIDE the pancakes, not just a few sprinkled on the top as though the cook forgot. Anyway, Patterson's is lucky to be one of the only games in town."}]
